OnvifProxy/bin/Debug/dbg_itv/WTF!.txt

так пашет:

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope" 
xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding" 
xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
xmlns:xsd="http://www.w3.org/2001/XMLSchema"
xmlns:wsa5="http://www.w3.org/2005/08/addressing" 
xmlns:xmime="http://www.w3.org/2005/05/xmlmime" 
xmlns:tt="http://www.onvif.org/ver10/schema" 
xmlns:xop="http://www.w3.org/2004/08/xop/include"
xmlns:wsrfbf="http://docs.oasis-open.org/wsrf/bf-2" 
xmlns:wstop="http://docs.oasis-open.org/wsn/t-1" 
xmlns:wsrf="http://docs.oasis-open.org/wsrf/r-2"
xmlns:tanl2aeb="http://www.onvif.org/ver20/analytics/wsdl/AnalyticsEngineBinding" 
xmlns:tanl2re="http://www.onvif.org/ver20/analytics/wsdl/RuleEngineBinding"
xmlns:tanl2="http://www.onvif.org/ver20/analytics/wsdl"
xmlns:tanlaeb="http://www.onvif.org/ver10/analytics/wsdl/AnalyticsEngineBinding"
xmlns:tanl="http://www.onvif.org/ver10/analytics/wsdl" 
xmlns:tanlre="http://www.onvif.org/ver10/analytics/wsdl/RuleEngineBinding" 
xmlns:tds="http://www.onvif.org/ver10/device/wsdl"
xmlns:tevcppb="http://www.onvif.org/ver10/events/wsdl/CreatePullPointBinding" 
xmlns:teveb="http://www.onvif.org/ver10/events/wsdl/EventBinding"
xmlns:tevncb="http://www.onvif.org/ver10/events/wsdl/NotificationConsumerBinding" 
xmlns:tevnpb="http://www.onvif.org/ver10/events/wsdl/NotificationProducerBinding"
xmlns:tevppb="http://www.onvif.org/ver10/events/wsdl/PullPointBinding" 
xmlns:tevpps="http://www.onvif.org/ver10/events/wsdl/PullPointSubscriptionBinding"
xmlns:tev="http://www.onvif.org/ver10/events/wsdl"
xmlns:tevpsmb="http://www.onvif.org/ver10/events/wsdl/PausableSubscriptionManagerBinding"
xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2"
xmlns:tevsmb="http://www.onvif.org/ver10/events/wsdl/SubscriptionManagerBinding" 
xmlns:timg="http://www.onvif.org/ver10/imaging/wsdl"
xmlns:timg2="http://www.onvif.org/ver20/imaging/wsdl"
xmlns:tmd="http://www.onvif.org/ver10/deviceIO/wsdl" 
xmlns:tptz="http://www.onvif.org/ver10/ptz/wsdl"
xmlns:tptz2="http://www.onvif.org/ver20/ptz/wsdl" xmlns:trc="http://www.onvif.org/ver10/recording/wsdl" xmlns:trp="http://www.onvif.org/ver10/replay/wsdl" xmlns:trt="http://www.onvif.org/ver10/media/wsdl" xmlns:tse="http://www.onvif.org/ver10/search/wsdl" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsd="http://schemas.xmlsoap.org/ws/2005/04/discovery" xmlns:c14n="http://www.w3.org/2001/10/xml-exc-c14n#" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:dn="http://www.onvif.org/ver10/network/wsdl" xmlns:tns1="http://www.onvif.org/ver10/topics">
<SOAP-ENV:Header  xmlns:wsa="http://www.w3.org/2005/08/addressing">
    <wsa:Action>http://www.onvif.org/ver10/device/wsdl/GetCapabilities</wsa:Action>
   </SOAP-ENV:Header>
<SOAP-ENV:Body>
<tds:GetCapabilities>
<tds:Category>All</tds:Category>
</tds:GetCapabilities>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>



а так нет:

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope" 
xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding" 
xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
xmlns:xsd="http://www.w3.org/2001/XMLSchema"
xmlns:wsa5="http://www.w3.org/2005/08/addressing" 
xmlns:xmime="http://www.w3.org/2005/05/xmlmime" 
xmlns:tt="http://www.onvif.org/ver10/schema" 
xmlns:xop="http://www.w3.org/2004/08/xop/include"
xmlns:wsrfbf="http://docs.oasis-open.org/wsrf/bf-2" 
xmlns:wstop="http://docs.oasis-open.org/wsn/t-1" 
xmlns:wsrf="http://docs.oasis-open.org/wsrf/r-2"
xmlns:tanl2aeb="http://www.onvif.org/ver20/analytics/wsdl/AnalyticsEngineBinding" 
xmlns:tanl2re="http://www.onvif.org/ver20/analytics/wsdl/RuleEngineBinding"
xmlns:tanl2="http://www.onvif.org/ver20/analytics/wsdl"
xmlns:tanlaeb="http://www.onvif.org/ver10/analytics/wsdl/AnalyticsEngineBinding"
xmlns:tanl="http://www.onvif.org/ver10/analytics/wsdl" 
xmlns:tanlre="http://www.onvif.org/ver10/analytics/wsdl/RuleEngineBinding" 
xmlns:tds="http://www.onvif.org/ver10/device/wsdl"
xmlns:tevcppb="http://www.onvif.org/ver10/events/wsdl/CreatePullPointBinding" 
xmlns:teveb="http://www.onvif.org/ver10/events/wsdl/EventBinding"
xmlns:tevncb="http://www.onvif.org/ver10/events/wsdl/NotificationConsumerBinding" 
xmlns:tevnpb="http://www.onvif.org/ver10/events/wsdl/NotificationProducerBinding"
xmlns:tevppb="http://www.onvif.org/ver10/events/wsdl/PullPointBinding" 
xmlns:tevpps="http://www.onvif.org/ver10/events/wsdl/PullPointSubscriptionBinding"
xmlns:tev="http://www.onvif.org/ver10/events/wsdl"
xmlns:tevpsmb="http://www.onvif.org/ver10/events/wsdl/PausableSubscriptionManagerBinding"
xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2"
xmlns:tevsmb="http://www.onvif.org/ver10/events/wsdl/SubscriptionManagerBinding" 
xmlns:timg="http://www.onvif.org/ver10/imaging/wsdl"
xmlns:timg2="http://www.onvif.org/ver20/imaging/wsdl"
xmlns:tmd="http://www.onvif.org/ver10/deviceIO/wsdl" 
xmlns:tptz="http://www.onvif.org/ver10/ptz/wsdl"
xmlns:tptz2="http://www.onvif.org/ver20/ptz/wsdl" xmlns:trc="http://www.onvif.org/ver10/recording/wsdl" xmlns:trp="http://www.onvif.org/ver10/replay/wsdl" xmlns:trt="http://www.onvif.org/ver10/media/wsdl" xmlns:tse="http://www.onvif.org/ver10/search/wsdl" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsd="http://schemas.xmlsoap.org/ws/2005/04/discovery" xmlns:c14n="http://www.w3.org/2001/10/xml-exc-c14n#" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:dn="http://www.onvif.org/ver10/network/wsdl" xmlns:tns1="http://www.onvif.org/ver10/topics">
<SOAP-ENV:Header>
    <wsa5:Action>http://www.onvif.org/ver10/device/wsdl/GetCapabilities</wsa:Action>
   </SOAP-ENV:Header>
<SOAP-ENV:Body>
<tds:GetCapabilities>
<tds:Category>All</tds:Category>
</tds:GetCapabilities>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>